Documents/Открепление.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>Открепление</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РегистрНакопления1</xr:Item>
				<xr:Item>AccumulationRegister.РегистрНаставники</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Наставник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Наставники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стажер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Стажеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/РегистрНаставники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<AccumulationRegister>
		<Properties>
			<Name>РегистрНаставники</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Прикреплен</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Стажер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Стажеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Наставник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Наставники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/Открепление/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РегистрНаставники.Наставник КАК Наставник,
		|	РегистрНаставники.Стажер КАК Стажер,
		|	СУММА(РегистрНаставники.Прикреплен) КАК Прикреплен
		|ИЗ
		|	РегистрНакопления.РегистрНаставники КАК РегистрНаставники
		|ГДЕ
		|	РегистрНаставники.Стажер = &Стажер
		|	И РегистрНаставники.Наставник = &Наставник
		|	И РегистрНаставники.Период <= &Период
		|
		|СГРУППИРОВАТЬ ПО
		|	РегистрНаставники.Наставник,
		|	РегистрНаставники.Стажер";
	
	Запрос.УстановитьПараметр("Наставник", Наставник);
	Запрос.УстановитьПараметр("Стажер", Стажер);
	Запрос.УстановитьПараметр("Период", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
	
		Сообщить("Ошибка");
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.Прикреплен = 0 Тогда
		
			 Сообщить("Ошибка");
			 Отказ = Истина;
			 Возврат;
		
		Иначе
		
			Движения.РегистрНаставники.Записывать = Истина;
			Движение = Движения.РегистрНаставники.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Наставник = Наставник;
			Движение.Прикреплен = 1;
			Движение.Стажер = Стажер;
		
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
